Repository: verdanatech/domains
Catalog: locales/*.po
Languages: fi_fi, ru_ru

source: Does not expire
fi_fi: Ei vanhene
ru_ru: Не законченный срок

source: Associate a domain
fi_fi: Liitä verkkotunnus
ru_ru: Привязать к домену

source: Domain
fi_fi: Verkkotunnus
ru_ru: Домен

source: Plugin Setup
fi_fi: Liitännäisen asetukset
ru_ru: Настройки плагина

source: Time of checking of validity of domains
fi_fi: Verkkotunnuksien voimassaolon tarkistusaika
ru_ru: Время проверки доступности домена

source: Domains expired since more
fi_fi: Verkkotunnukset, joiden voimassaolo päättyy yli
ru_ru: Срок домена истек более

source: Domains expiring in less than
fi_fi: Verkkotunnukset, joiden voimassaoloaika päättyy alle
ru_ru: Срок домена истечет

source: Empty for infinite
fi_fi: Tyhjä = Ääretön
ru_ru: Для неопределенных

source: Expired or expiring domains
fi_fi: Vanhentuneet tai vanhentumassa olevat verkkotunnukset
ru_ru: Истеченые или истекающие сроки действия домена

source: Domain type
fi_fi: Verkkotunnuksen tyyppi
ru_ru: Тип домена

source: Expired domains
fi_fi: Vanhentuneet verkkotunnukset
ru_ru: Домены с истекающим сроком

source: Expiring domains
fi_fi: Vanhentumassa olevat verkkotunnukset
ru_ru: Освобождающиеся домены
